In [116]:
import pandas as pd
data = pd.read_csv('titanic.csv')
data.columns[5]

'Age'

In [22]:
data.head
data.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [51]:
data.at[5, 'Age'] = 28.0
data.to_csv('titanic.csv', index=False)
data.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                        28.0
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [49]:
print(data.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age             object
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [50]:
data['Age'] = pd.to_numeric(data['Age'], errors='coerce')
filtered = data[data['Age'] > 18 ]
count = len(filtered)
print(count)

579

In [80]:
''' x = 0
for person in data["Sex"]:
    if person == "male":
        count = count + 1
            
counts = (count / len(data)) * 100
counts
'''

'''filtered_sex = data[data['Sex'] == "male" ]
count_sex = len(filtered_sex)
print(count_sex)
y = (count_sex / len(data)) * 100
print(y)
'''

'''
f_s = data[data['Sex'] == "male"], data.shape() / len(data) * 100

not working, unsure why
'''

TypeError: 'tuple' object is not callable

In [86]:
import pandas as pd
info = pd.read_csv('ship.csv')
info.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [104]:
Classes = info['Pclass'].value_counts()
freqTable = pd.DataFrame(Classes)
y = freqTable["percent"] = (Classes / len(info))*100
print(y)

3    55.106622
1    24.242424
2    20.650954
Name: Pclass, dtype: float64

In [105]:
Dest = info['Embarked'].value_counts()
freqTable = pd.DataFrame(Dest)
z = freqTable["percent"] = (Dest / len(info))*100
print(z)

S    72.278339
C    18.855219
Q     8.641975
Name: Embarked, dtype: float64

In [106]:
specific_id = 528
result = data[data['PassengerId'] == specific_id]

print(result)

     PassengerId  Survived  Pclass                Name   Sex  Age  SibSp  \
527          528         0       1  Farthing, Mr. John  male  NaN      0

     Parch    Ticket      Fare Cabin Embarked
527      0  PC 17483  221.7792   C95        S

In [115]:
idx = 0
for person in data["Name"]:
    if "Fannie" in person:
        break
    idx += 1
data.loc[idx]

PassengerId                              707
Survived                                   1
Pclass                                     2
Name           Kelly, Mrs. Florence "Fannie"
Sex                                   female
Age                                     45.0
SibSp                                      0
Parch                                      0
Ticket                                223596
Fare                                    13.5
Cabin                                    NaN
Embarked                                   S
Name: 706, dtype: object

In [133]:
contingency_table = pd.crosstab(data['Sex'], data['Survived'], normalize='index') * 100
print(contingency_table)

Survived          0          1
Sex
female    25.796178  74.203822
male      81.206897  18.793103

In [137]:
maleSurvive = 0
femSurvive = 0
maleDied = 0
femDied = 0

for idx in range(len(data)):
    if data.loc[idx]["Sex"] == "male" and  data.loc[idx]["Survived"] == 0:
        maleDied += 1
    elif data.loc[idx]["Sex"] == "male" and data.loc[idx]["Survived"] == 1:
        maleSurvive += 1
    elif data.loc[idx]["Sex"] == "female" and data.loc[idx]["Survived"] == 0:
        femDied += 1
    elif data.loc[idx]["Sex"] == "female" and data.loc[idx]["Survived"] == 1:
        femSurvive += 1
    
    conTable = pd.DataFrame({
        "Male":[maleSurvive, maleDied], 
        "Female": [femSurvive, femDied]
    })
    
    conTable.head()

In [138]:
contingency_table = pd.crosstab(data['Sex'], data['Survived'])
print(contingency_table)

Survived    0    1
Sex
female     81  233
male      471  109

In [141]:
data['AgeGroup'] = data['Age'].apply(lambda x: '<18' if x < 18 else '>=18')
cont_table = pd.crosstab(data['AgeGroup'], data['Survived'], rownames=['Age Group'], colnames=['Survived'])
print(cont_table)

Survived     0    1
Age Group
<18         52   61
>=18       500  281

In [162]:
ChildSurv = 0
ChildDied = 0
AdultSurv = 0
AdultDied = 0
ElderSurv = 0
ElderDied = 0
ChildTotal = 0
AdultTotal = 0
ElderTotal = 0
AllPeople = 0
AllPeopleDied = 0
AllPeopleSurv = 0
for idx in range(len(data)):
    if data.loc[idx]["Age"] < 18 and data.loc [idx]["Survived"] == 1:
        ChildSurv += 1
        ChildTotal += 1
        AllPeople += 1
        AllPeopleSurv += 1
    elif data.loc[idx]['Age'] < 18 and data.loc [idx]["Survived"] == 0:
        ChildDied += 1
        ChildTotal += 1
        AllPeople += 1
        AllPeopleDied += 1
    elif data.loc[idx]['Age'] >= 18 and data.loc [idx]["Age"] < 60 and data.loc[idx]["Survived"] == 1:
        AdultSurv += 1
        AdultTotal += 1
        AllPeople += 1
        AllPeopleSurv += 1
    elif data.loc[idx]['Age'] >= 18 and data.loc [idx]["Age"] < 60 and data.loc[idx]["Survived"] == 0:
        AdultDied += 1
        AdultTotal += 1
        AllPeople += 1
        AllPeopleDied += 1
    elif data.loc[idx]["Age"] > 60 and data.loc [idx]["Survived"] == 1:
        ElderSurv += 1
        ElderTotal += 1
        AllPeople += 1
        AllPeopleSurv += 1
    elif data.loc[idx]["Age"] > 60 and data.loc [idx]["Survived"] == 0:
        ElderDied += 1
        ElderTotal += 1
        AllPeople += 1
        AllPeopleDied += 1
        
 

conTable = {
    "Child": [ChildSurv/ChildTotal *100, ChildDied/ChildTotal *100],
    "Adult": [AdultSurv/AdultTotal *100, AdultDied/AdultTotal *100],
    "Elder": [ElderSurv/ElderTotal *100, ElderDied/ElderTotal *100],
    "Total": [AllPeopleSurv/AllPeople *100, AllPeopleDied/AllPeople*100]
}

df2 = pd.DataFrame(conTable)
df2.index = ["Survived", "Died"]
df2.head()

              Child      Adult      Elder      Total
Survived  53.982301  38.341969  22.727273  40.336134
Died      46.017699  61.658031  77.272727  59.663866